Тестовая_база_ERP_14/src/Documents/РЭЙ_СправкаОПодтверждающихДокументах/РЭЙ_СправкаОПодтверждающихДокументах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РЭЙ_СправкаОПодтверждающихДокументах</name>
  <basedOn>Document.РЭЙ_СправкаОПодтверждающихДокументах</basedOn>
  <registerRecords>InformationRegister.РЭЙ_СправкиВалютногоКонтроля</registerRecords>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактВЭД</name>
    <type>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РЭЙ_СправкаОПодтверждающихДокументах</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортСделки</name>
    <type>
      <types>DocumentRef.РЭЙ_ПаспортСделки</types>
    </type>
  </attributes>
  <attributes>
    <name>Первичное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешениеЦБ</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонУполномоченногоВК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоПоГТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченныйВК</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ФТСПередалаГТДвЦБР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодтверждающиеДокументы</name>
    <attributes>
      <name>ВалютаДокумента</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаКонтракта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.РЭЙ_ВидыПодтверждающихДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТДПоИмпорту</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаШтампаТаможни</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопСоглашение</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДляПечати</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемыйСрок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПоставки</name>
      <type>
        <types>EnumRef.РЭЙ_ПризнакиПоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаГрузоотправителяГрузополучателя</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвансаВВалютеДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвансаВВалютеКонтракта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеКонтракта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удалить_АвансоваяСправка</name>
      <type>
        <types>DocumentRef.РЭЙ_СправкаОВалютныхОперациях</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить_АвансовыйРасчетныйДокумент</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодтверждающиеДокументыРучные</name>
    <attributes>
      <name>ВалютаДокумента</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаКонтракта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.РЭЙ_ВидыПодтверждающихДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаШтампаТаможни</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопСоглашение</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДляПечати</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемыйСрок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПоставки</name>
      <type>
        <types>EnumRef.РЭЙ_ПризнакиПоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаГрузоотправителяГрузополучателя</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвансаВВалютеДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвансаВВалютеКонтракта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеКонтракта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Авансы</name>
    <attributes>
      <name>АвансоваяСправка</name>
      <type>
        <types>DocumentRef.РЭЙ_СправкаОВалютныхОперациях</types>
      </type>
    </attributes>
    <attributes>
      <name>АвансовыйРасчетныйДокумент</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвансаВВалютеКонтракта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_СправкиВалютногоКонтроля/РЭЙ_СправкиВалютногоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РЭЙ_СправкиВалютногоКонтроля</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Справка</name>
    <type>
      <types>DocumentRef.РЭЙ_СправкаОВалютныхОперациях</types>
      <types>DocumentRef.РЭЙ_СправкаОПодтверждающихДокументах</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалютеДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалютеКонтракта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоДебет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>КонтрактВЭД</name>
    <type>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПаспортСделки</name>
    <type>
      <types>DocumentRef.РЭЙ_ПаспортСделки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторРучнойОперации</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопСоглашение</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Documents/РЭЙ_СправкаОПодтверждающихДокументах/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СтатусЗадачаВЭДСоздана();
	
	ПроведениеПоРегиструСправкиВалютногоКонтроля();
	
	РЭЙ_ЗадачиСервер.ОбработкаЗадачПоКонтролюОжидаемыхСроков();
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Для Каждого СтрокаТаб Из ПодтверждающиеДокументы Цикл
		//Имя = СокрЛП(ВРег(СтрокаТаб.Документ.Метаданные().Имя));
		//Если Имя = ВРег("ПоступлениеТоваровУслуг") Или Имя = ВРег("ПоступлениеДопРасходов") Тогда
			РЭЙ_ЗадачиСервер.УстановитьСтатусЗадачиВЭД(СтрокаТаб.Документ, "ПодлежитСозданию")
		//КонецЕсли;
	КонецЦикла; 
	
	РЭЙ_ЗадачиСервер.ОбработкаЗадачПоКонтролюОжидаемыхСроков(Ссылка);
	
	// {!!! Перенести в модуль формы
	#Если Клиент Тогда
		Оповестить("ИзмененСтатусЗадачиВЭД");
	#КонецЕсли
	// }!!!
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПрефиксацияОбъектовСобытия.ПроверитьНомерДокументаПоДатеИОрганизации(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если Константы.РЭЙ_ИспользоватьПрефиксыВНумерацииДокументовВЭД.Получить() Тогда		
		ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//Проверка соответствия сумм указаных в СПД с суммами в документах
	Если Константы.РЭЙ_НеКонтролироватьСуммыВСправкахВалютногоКонтроля.Получить() = Ложь Тогда
		ТаблицаДокументов = ПодтверждающиеДокументы.Выгрузить(, "Документ, НомерГТД, ВалютаДокумента, ВалютаКонтракта, СуммаВВалютеДокумента, СуммаВВалютеКонтракта");
		ТаблицаДокументов.Свернуть("Документ, НомерГТД, ВалютаДокумента, ВалютаКонтракта", "СуммаВВалютеДокумента, СуммаВВалютеКонтракта");
		Для Каждого СтрокаТЧ Из ТаблицаДокументов Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.Документ) Тогда
				текСуммаДокумента = РЭЙ_СлужебныйСервер.ПолучитьСуммуДокументаДляСПД(СтрокаТЧ.Документ, КонтрактВЭД, СтрокаТЧ.НомерГТД);
				Если СтрокаТЧ.Документ.Валюта = СтрокаТЧ.ВалютаДокумента Тогда
					Если текСуммаДокумента <> СтрокаТЧ.СуммаВВалютеДокумента Тогда
						текТекстОшибки = РЭЙ_СлужебныйСервер.ПостроительСтроки("Сумма {0}{1} документа {2} отличается от суммы {3}{4} , указанной в СПД.",
						СтрокаТЧ.ВалютаДокумента, 
						Формат(текСуммаДокумента, "ЧДЦ=2; ЧН=0,00"),
						РЭЙ_СлужебныйСервер.КраткоеПредставлениеДокумента(СтрокаТЧ.Документ),
						СтрокаТЧ.ВалютаДокумента,
						Формат(СтрокаТЧ.СуммаВВалютеДокумента, "ЧДЦ=2; ЧН=0,00"));
						
						СтрокиСОшибками = ПодтверждающиеДокументы.НайтиСтроки(Новый Структура("Документ", СтрокаТЧ.Документ));
						Для Каждого СтрокаСОшибкой Из СтрокиСОшибками Цикл
							Сообщение = Новый СообщениеПользователю();
							Сообщение.Текст = текТекстОшибки;
							Сообщение.Поле = "ПодтверждающиеДокументы[" + ПодтверждающиеДокументы.Индекс(СтрокаСОшибкой) + "].Документ";
							Сообщение.УстановитьДанные(ЭтотОбъект);
							Сообщение.Сообщить();
							
							Отказ = Истина;
						КонецЦикла;
					КонецЕсли;
				Иначе
					Если текСуммаДокумента <> СтрокаТЧ.СуммаВВалютеКонтракта Тогда
						текТекстОшибки = РЭЙ_СлужебныйСервер.ПостроительСтроки("Сумма {0}{1} документа {2} отличается от суммы {3}{4} , указанной в СПД.",
						СтрокаТЧ.ВалютаКонтракта, 
						Формат(текСуммаДокумента, "ЧДЦ=2; ЧН=0,00"),
						РЭЙ_СлужебныйСервер.КраткоеПредставлениеДокумента(СтрокаТЧ.Документ),
						СтрокаТЧ.ВалютаКонтракта,
						Формат(СтрокаТЧ.СуммаВВалютеКонтракта, "ЧДЦ=2; ЧН=0,00"));
						
						СтрокиСОшибками = ПодтверждающиеДокументы.НайтиСтроки(Новый Структура("Документ", СтрокаТЧ.Документ));
						Для Каждого СтрокаСОшибкой Из СтрокиСОшибками Цикл
							Сообщение = Новый СообщениеПользователю();
							Сообщение.Текст = текТекстОшибки;
							Сообщение.Поле = "ПодтверждающиеДокументы[" + ПодтверждающиеДокументы.Индекс(СтрокаСОшибкой) + "].Документ";
							Сообщение.УстановитьДанные(ЭтотОбъект);
							Сообщение.Сообщить();
							
							Отказ = Истина;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Печать

Функция ПолучитьДанныеДляПечати() Экспорт
	Возврат ДанныеДляПечати_2018();
КонецФункции

#Область ПечатьАктуальнаяВерсия

Функция ДанныеДляПечати_2018()
	ДанныеДляПечати = Новый Структура;
	ШапкаДанных = Новый Структура;
	ДанныеДляПечати.Вставить("Шапка", ШапкаДанных);
	
	// банк
	ШапкаДанных.Вставить("БанкНаименование", РЭЙ_СлужебныйСервер.ПолучитьНаименованиеБанкаДляПечати(Банк));
	ШапкаДанных.Вставить("БанкКод", Банк.Код);
	
	// организация
	Если Не ПустаяСтрока(Организация.НаименованиеПолное) Тогда
		ШапкаДанных.Вставить("ОрганизацияНаименование", Организация.НаименованиеПолное);
	Иначе
		ШапкаДанных.Вставить("ОрганизацияНаименование", Организация.Наименование);
	КонецЕсли;
	СтрокиНаименованияДляКлиентБанка = Организация.РЭЙ_НаименованияДляКлиентБанка.НайтиСтроки(Новый Структура("ТипКлиентБанка", Банк.РЭЙ_ТипКлиентБанка));
	Если СтрокиНаименованияДляКлиентБанка.Количество() > 0 Тогда
		ШапкаДанных.Вставить("ОрганизацияНаименованиеДляКлиентБанка", СтрокиНаименованияДляКлиентБанка[0].Наименование);
	Иначе
		ШапкаДанных.Вставить("ОрганизацияНаименованиеДляКлиентБанка", ШапкаДанных.ОрганизацияНаименование);
	КонецЕсли;
	
	// дата
	Если Не Корректировка Тогда
		ШапкаДанных.Вставить("Дата", Дата);
	Иначе
		ШапкаДанных.Вставить("Дата", Основание.Дата);
	КонецЕсли;
	ШапкаДанных.Вставить("Дата_Представление", Формат(ШапкаДанных.Дата, "ДФ=dd.MM.yyyy"));
	
	// номер паспорта сделки
	ШапкаДанных.Вставить("НомерПаспортаСделки", КонтрактВЭД.ПаспортСделки.НомерПаспортаСделки);
	Для Счетчик = 1 По 22 Цикл
		ШапкаДанных.Вставить("НПС_" + Счетчик, Сред(ШапкаДанных.НомерПаспортаСделки, Счетчик ,1));
	КонецЦикла;
	
	// признак корректировки
	ШапкаДанных.Вставить("Корректировка", Корректировка);
	ШапкаДанных.Вставить("НомерКорректировки", НомерКорректировки);
	Если Корректировка Тогда
		ШапкаДанных.Вставить("ПризнакКорректировки", "*(" + НомерКорректировки + ")");	
		ШапкаДанных.Вставить("Корректировка_1_0", 1);
		
		ЗапросДатаКорректируемогоДокумента = Новый Запрос;
		ЗапросДатаКорректируемогоДокумента.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(СПД.Дата) КАК Дата
		|ИЗ
		|	Документ.РЭЙ_СправкаОПодтверждающихДокументах КАК СПД
		|ГДЕ
		|	СПД.Дата < &ДатаТекущегоДокумента
		|	И СПД.Проведен
		|	И (СПД.Основание = &Основание
		|			ИЛИ СПД.Ссылка = &Основание)";
		
		ЗапросДатаКорректируемогоДокумента.УстановитьПараметр("ДатаТекущегоДокумента", Дата);
		ЗапросДатаКорректируемогоДокумента.УстановитьПараметр("Основание", Основание);
		
		ВыборкаДатаКорректируемогоДокумента = ЗапросДатаКорректируемогоДокумента.Выполнить().Выбрать();
		ВыборкаДатаКорректируемогоДокумента.Следующий();
		ШапкаДанных.Вставить("ДатаКорректируемогоДокумента", ВыборкаДатаКорректируемогоДокумента.Дата);
	Иначе
		ШапкаДанных.Вставить("ПризнакКорректировки", "");
		ШапкаДанных.Вставить("Корректировка_1_0", 0);
		ШапкаДанных.Вставить("ДатаКорректируемогоДокумента", Дата(1,1,1));
	КонецЕсли;
	
	// ответственные лица
	ШапкаДанных.Вставить("ФИОРуководителя", РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(Руководитель, ШапкаДанных.Дата));
	ШапкаДанных.Вставить("ФИОБухгалтера", РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ГлавныйБухгалтер, ШапкаДанных.Дата));
	
	// комментарий
	ШапкаДанных.Вставить("Комментарий", Комментарий);
	
	ДанныеДляПечати.Вставить("Таблица1", Новый Массив);
	ДанныеДляПечати.Вставить("Таблица2", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.НомерСтрокиДляПечати КАК НомерСтрокиДляПечати,
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.СуммаВВалютеКонтракта КАК СуммаВВалютеКонтракта,
	|	ТЧ.СуммаВВалютеДокумента КАК СуммаВВалютеДокумента,
	|	ТЧ.СуммаАвансаВВалютеКонтракта КАК СуммаАвансаВВалютеКонтракта,
	|	ТЧ.СуммаАвансаВВалютеДокумента КАК СуммаАвансаВВалютеДокумента
	|ИЗ
	|	Документ.РЭЙ_СправкаОПодтверждающихДокументах.ПодтверждающиеДокументы КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиДляПечати,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(СуммаВВалютеКонтракта),
	|	СУММА(СуммаВВалютеДокумента),
	|	СУММА(СуммаАвансаВВалютеКонтракта),
	|	СУММА(СуммаАвансаВВалютеДокумента)
	|ПО
	|	НомерСтрокиДляПечати";
	
	Если РучноеЗаполнение Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.РЭЙ_СправкаОПодтверждающихДокументах.ПодтверждающиеДокументы", "Документ.РЭЙ_СправкаОПодтверждающихДокументах.ПодтверждающиеДокументыРучные");
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Пока ВыборкаИтоги.Следующий() Цикл
		СтрокаТаблицы1 = Новый Структура;
		
		ВыборкаСтроки = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаСтроки.Следующий();
		
		Если Не РучноеЗаполнение Тогда
			ИмяТЧ = "ПодтверждающиеДокументы";
			СтрокаТЧ = ЭтотОбъект[ИмяТЧ][ВыборкаСтроки.НомерСтроки - 1];
			текДокумент = СтрокаТЧ.Документ;
		Иначе
			ИмяТЧ = "ПодтверждающиеДокументыРучные";
			СтрокаТЧ = ЭтотОбъект[ИмяТЧ][ВыборкаСтроки.НомерСтроки - 1];
			текДокумент = Неопределено;
		КонецЕсли;
		
		// Таблица 1
		// номер строки
		СтрокаТаблицы1.Вставить("НомерСтроки", ВыборкаИтоги.НомерСтрокиДляПечати);
		
		// подтверждающий документ
		СтрокаТаблицы1.Вставить("НомерПодтверждающегоДокумента_Представление", РЭЙ_СлужебныйСервер.ПолучитьНомерПодтверждающегоДокумента(СтрокаТЧ, РучноеЗаполнение));
		Если ЗначениеЗаполнено(СтрокаТЧ.НомерГТД) Тогда
			СтрокаТаблицы1.Вставить("НомерГТД", Строка(СтрокаТЧ.НомерГТД));
			СтрокаТаблицы1.Вставить("НомерПодтверждающегоДокумента", "");
		Иначе
			СтрокаТаблицы1.Вставить("НомерГТД", "");                 
			СтрокаТаблицы1.Вставить("НомерПодтверждающегоДокумента", СтрокаТаблицы1.НомерПодтверждающегоДокумента_Представление);
		КонецЕсли;
		
		текДатаПодтверджающегоДокумента = РЭЙ_СлужебныйСервер.ПолучитьДатуПодтверждающегоДокумента(СтрокаТЧ, РучноеЗаполнение);
		СтрокаТаблицы1.Вставить("ДатаПодтверждающегоДокумента_ВсегдаЗаполнено", текДатаПодтверджающегоДокумента);
		Если ЗначениеЗаполнено(СтрокаТЧ.НомерГТД) Тогда
			текДатаПодтверджающегоДокумента = Дата(1,1,1);
		КонецЕсли;
		СтрокаТаблицы1.Вставить("ДатаПодтверждающегоДокумента", текДатаПодтверджающегоДокумента);
		СтрокаТаблицы1.Вставить("ДатаПодтверждающегоДокумента_Представление", Формат(СтрокаТаблицы1.ДатаПодтверждающегоДокумента, "ДФ=dd.MM.yyyy"));
		
		// вид документа
		СтрокаТаблицы1.Вставить("ВидДокумента", СтрокаТЧ.ВидДокумента.Код);
		
		// код валюты документа
		СтрокаТаблицы1.Вставить("ВалютаДокументаКод", СтрокаТЧ.ВалютаДокумента.Код);

		// сумма в валюте документа
		СтрокаТаблицы1.Вставить("СуммаВВалютеДокумента", ВыборкаИтоги.СуммаВВалютеДокумента);
		Если ВыборкаИтоги.СуммаАвансаВВалютеДокумента = 0 Или ВыборкаИтоги.СуммаВВалютеДокумента = ВыборкаИтоги.СуммаАвансаВВалютеДокумента Тогда
			СтрокаТаблицы1.Вставить("СуммаАвансаВВалютеДокумента", 0);
			СтрокаТаблицы1.Вставить("СуммаВВалютеДокумента_Представление", Формат(СтрокаТаблицы1.СуммаВВалютеДокумента, "ЧДЦ=2"));
		Иначе	
			СтрокаТаблицы1.Вставить("СуммаАвансаВВалютеДокумента", ВыборкаИтоги.СуммаАвансаВВалютеДокумента);
			СтрокаТаблицы1.Вставить("СуммаВВалютеДокумента_Представление", Формат(СтрокаТаблицы1.СуммаВВалютеДокумента, "ЧДЦ=2") + "/" + Формат(СтрокаТаблицы1.СуммаАвансаВВалютеДокумента, "ЧДЦ=2"));
		КонецЕсли;
		
		// код валюты контракта
		СтрокаТаблицы1.Вставить("ВалютаКонтрактаКод", СтрокаТЧ.ВалютаКонтракта.Код);

		// сумма в валюте контракта
		СтрокаТаблицы1.Вставить("СуммаВВалютеКонтракта", ВыборкаИтоги.СуммаВВалютеКонтракта);
		Если ВыборкаИтоги.СуммаАвансаВВалютеКонтракта = 0 Или ВыборкаИтоги.СуммаВВалютеКонтракта = ВыборкаИтоги.СуммаАвансаВВалютеКонтракта Тогда
			СтрокаТаблицы1.Вставить("СуммаАвансаВВалютеКонтракта", 0);
			СтрокаТаблицы1.Вставить("СуммаВВалютеКонтракта_Представление", Формат(СтрокаТаблицы1.СуммаВВалютеКонтракта, "ЧДЦ=2"));
		Иначе	
			СтрокаТаблицы1.Вставить("СуммаАвансаВВалютеКонтракта", ВыборкаИтоги.СуммаАвансаВВалютеКонтракта);
			СтрокаТаблицы1.Вставить("СуммаВВалютеКонтракта_Представление", Формат(СтрокаТаблицы1.СуммаВВалютеКонтракта, "ЧДЦ=2") + "/" + Формат(СтрокаТаблицы1.СуммаАвансаВВалютеКонтракта, "ЧДЦ=2"));
		КонецЕсли;
		
		// признак поставки
		СтрокаТаблицы1.Вставить("ПризнакПоставки", Сред(Строка(СтрокаТЧ.ПризнакПоставки), 1, 1));
		
		// ожидаемый срок
		СтрокаТаблицы1.Вставить("ОжидаемыйСрок", СтрокаТЧ.ОжидаемыйСрок);
		СтрокаТаблицы1.Вставить("ОжидаемыйСрок_Представление", Формат(СтрокаТаблицы1.ОжидаемыйСрок, "ДФ=dd.MM.yyyy"));
		
		// код страны грузоотправителя/грузополучателя
		СтрокаТаблицы1.Вставить("КодСтраныГрузоотправителя", СтрокаТЧ.СтранаГрузоотправителяГрузополучателя.Код);
		
		// признак корректировки
		Если СтрокаТЧ.Корректировка Тогда
			СтрокаТаблицы1.Вставить("ПризнакКорректировки", Формат(ШапкаДанных.ДатаКорректируемогоДокумента, "ДФ=dd.MM.yyyy"));
		Иначе
			СтрокаТаблицы1.Вставить("ПризнакКорректировки", "");
		КонецЕсли;
		
		ДанныеДляПечати.Таблица1.Добавить(СтрокаТаблицы1);
		
		//Таблица 2
		ВыборкаСтроки.Сбросить();
		ТекстПримечания = "";
		Пока ВыборкаСтроки.Следующий() Цикл
			СтрокаТЧ_Примечание = ЭтотОбъект[ИмяТЧ][ВыборкаСтроки.НомерСтроки - 1];
			Если Не ПустаяСтрока(СтрокаТЧ_Примечание.Примечание) Тогда
				ТекстПримечания = ТекстПримечания + ?(ТекстПримечания = "", "", "; ") + СокрЛП(СтрокаТЧ_Примечание.Примечание);
			КонецЕсли;
		КонецЦикла;
		Если Не ПустаяСтрока(ТекстПримечания) Тогда
			СтрокаТаблицы2 = Новый Структура;
			СтрокаТаблицы2.Вставить("НомерСтроки", ВыборкаИтоги.НомерСтрокиДляПечати);
			СтрокаТаблицы2.Вставить("Содержание", ТекстПримечания);
			ДанныеДляПечати.Таблица2.Добавить(СтрокаТаблицы2);
		КонецЕсли;
	КонецЦикла; 
		
	Возврат ДанныеДляПечати;
КонецФункции

Функция ПечатьСПД_2018() Экспорт
	ДанныеДляПечати = ДанныеДляПечати_2018();
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СправкаОПодтверждающихДокументах2018";
	
	Макет = ПолучитьМакет("СправкаОПодтверждающихДокументах_2018");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заполнить(ДанныеДляПечати.Шапка);
	ТабДокумент.Вывести(Область);
	
	Если ДанныеДляПечати.Таблица1.Количество() = 0 Тогда
		Область = Макет.ПолучитьОбласть("Строка");
		ТабДокумент.Вывести(Область);
	Иначе
		Для Каждого СтрокаТЧ Из ДанныеДляПечати.Таблица1 Цикл
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДокумент.Вывести(Область);
		КонецЦикла; 
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("ШапкаПримечание");
	ТабДокумент.Вывести(Область);
	
	Для Каждого СтрокаТЧ Из ДанныеДляПечати.Таблица2 Цикл
		Область = Макет.ПолучитьОбласть("Примечание");
		Область.Параметры.Заполнить(СтрокаТЧ);
		ТабДокумент.Вывести(Область);
	КонецЦикла; 
	
	Область = Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.Заполнить(ДанныеДляПечати.Шапка);
	ТабДокумент.Вывести(Область);
	
	УстановитьСтатусЗадачРаспечатана(1);
	
	Возврат ТабДокумент;
КонецФункции

#КонецОбласти

#Область ПечатьУстаревшиеВерсии

Функция ДанныеДляПечати_2015()
	ДанныеДляПечати = Новый Структура;
	ШапкаДанных = Новый Структура;
	ДанныеДляПечати.Вставить("Шапка", ШапкаДанных);
	
	// банк
	ШапкаДанных.Вставить("БанкНаименование", РЭЙ_СлужебныйСервер.ПолучитьНаименованиеБанкаДляПечати(Банк));
	ШапкаДанных.Вставить("БанкКод", Банк.Код);
	
	// организация
	Если Не ПустаяСтрока(Организация.НаименованиеПолное) Тогда
		ШапкаДанных.Вставить("ОрганизацияНаименование", Организация.НаименованиеПолное);
	Иначе
		ШапкаДанных.Вставить("ОрганизацияНаименование", Организация.Наименование);
	КонецЕсли;
	СтрокиНаименованияДляКлиентБанка = Организация.РЭЙ_НаименованияДляКлиентБанка.НайтиСтроки(Новый Структура("ТипКлиентБанка", Банк.РЭЙ_ТипКлиентБанка));
	Если СтрокиНаименованияДляКлиентБанка.Количество() > 0 Тогда
		ШапкаДанных.Вставить("ОрганизацияНаименованиеДляКлиентБанка", СтрокиНаименованияДляКлиентБанка[0].Наименование);
	Иначе
		ШапкаДанных.Вставить("ОрганизацияНаименованиеДляКлиентБанка", ШапкаДанных.ОрганизацияНаименование);
	КонецЕсли;
	
	// дата
	Если Не Корректировка Тогда
		ШапкаДанных.Вставить("Дата", Дата);
	Иначе
		ШапкаДанных.Вставить("Дата", Основание.Дата);
	КонецЕсли;
	ШапкаДанных.Вставить("Дата_Представление", Формат(ШапкаДанных.Дата, "ДФ=dd.MM.yyyy"));
	
	// номер паспорта сделки
	ШапкаДанных.Вставить("НомерПаспортаСделки", КонтрактВЭД.ПаспортСделки.НомерПаспортаСделки);
	Для Счетчик = 1 По 22 Цикл
		ШапкаДанных.Вставить("НПС_" + Счетчик, Сред(ШапкаДанных.НомерПаспортаСделки, Счетчик ,1));
	КонецЦикла;
	
	// признак корректировки
	ШапкаДанных.Вставить("Корректировка", Корректировка);
	ШапкаДанных.Вставить("НомерКорректировки", НомерКорректировки);
	Если Корректировка Тогда
		ШапкаДанных.Вставить("ПризнакКорректировки", "*(" + НомерКорректировки + ")");	
		ШапкаДанных.Вставить("Корректировка_1_0", 1);
	Иначе
		ШапкаДанных.Вставить("ПризнакКорректировки", "");
		ШапкаДанных.Вставить("Корректировка_1_0", 0);
	КонецЕсли;
	
	// ответственные лица
	ШапкаДанных.Вставить("ФИОРуководителя", РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(Руководитель, ШапкаДанных.Дата));
	ШапкаДанных.Вставить("ФИОБухгалтера", РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ГлавныйБухгалтер, ШапкаДанных.Дата));
	
	// комментарий
	ШапкаДанных.Вставить("Комментарий", Комментарий);
	
	ДанныеДляПечати.Вставить("Таблица1", Новый Массив);
	ДанныеДляПечати.Вставить("Таблица2", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.НомерСтрокиДляПечати КАК НомерСтрокиДляПечати,
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.СуммаВВалютеКонтракта КАК СуммаВВалютеКонтракта,
	|	ТЧ.СуммаВВалютеДокумента КАК СуммаВВалютеДокумента,
	|	ТЧ.СуммаАвансаВВалютеКонтракта КАК СуммаАвансаВВалютеКонтракта,
	|	ТЧ.СуммаАвансаВВалютеДокумента КАК СуммаАвансаВВалютеДокумента
	|ИЗ
	|	Документ.РЭЙ_СправкаОПодтверждающихДокументах.ПодтверждающиеДокументы КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|	И (ТЧ.Ссылка.Первичное
	|			ИЛИ ТЧ.Ссылка.Корректировка
	|				И ТЧ.Корректировка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиДляПечати,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(СуммаВВалютеКонтракта),
	|	СУММА(СуммаВВалютеДокумента),
	|	СУММА(СуммаАвансаВВалютеКонтракта),
	|	СУММА(СуммаАвансаВВалютеДокумента)
	|ПО
	|	НомерСтрокиДляПечати";
	
	Если РучноеЗаполнение Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.РЭЙ_СправкаОПодтверждающихДокументах.ПодтверждающиеДокументы", "Документ.РЭЙ_СправкаОПодтверждающихДокументах.ПодтверждающиеДокументыРучные");
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Пока ВыборкаИтоги.Следующий() Цикл
		СтрокаТаблицы1 = Новый Структура;
		
		ВыборкаСтроки = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаСтроки.Следующий();
		
		Если Не РучноеЗаполнение Тогда
			ИмяТЧ = "ПодтверждающиеДокументы";
			СтрокаТЧ = ЭтотОбъект[ИмяТЧ][ВыборкаСтроки.НомерСтроки - 1];
			текДокумент = СтрокаТЧ.Документ;
		Иначе
			ИмяТЧ = "ПодтверждающиеДокументыРучные";
			СтрокаТЧ = ЭтотОбъект[ИмяТЧ][ВыборкаСтроки.НомерСтроки - 1];
			текДокумент = Неопределено;
		КонецЕсли;
		
		// Таблица 1
		// номер строки
		СтрокаТаблицы1.Вставить("НомерСтроки", ВыборкаИтоги.НомерСтрокиДляПечати);
		
		// подтверждающий документ
		СтрокаТаблицы1.Вставить("НомерПодтверждающегоДокумента_Представление", РЭЙ_СлужебныйСервер.ПолучитьНомерПодтверждающегоДокумента(СтрокаТЧ, РучноеЗаполнение));
		Если ЗначениеЗаполнено(СтрокаТЧ.НомерГТД) Тогда
			СтрокаТаблицы1.Вставить("НомерГТД", Строка(СтрокаТЧ.НомерГТД));
			СтрокаТаблицы1.Вставить("НомерПодтверждающегоДокумента", "");
		Иначе
			СтрокаТаблицы1.Вставить("НомерГТД", "");                 
			СтрокаТаблицы1.Вставить("НомерПодтверждающегоДокумента", СтрокаТаблицы1.НомерПодтверждающегоДокумента_Представление);
		КонецЕсли;
		
		текДатаПодтверджающегоДокумента = РЭЙ_СлужебныйСервер.ПолучитьДатуПодтверждающегоДокумента(СтрокаТЧ, РучноеЗаполнение);
		СтрокаТаблицы1.Вставить("ДатаПодтверждающегоДокумента_ВсегдаЗаполнено", текДатаПодтверджающегоДокумента);
		Если ЗначениеЗаполнено(СтрокаТЧ.НомерГТД) Тогда
			текДатаПодтверджающегоДокумента = Дата(1,1,1);
		КонецЕсли;
		СтрокаТаблицы1.Вставить("ДатаПодтверждающегоДокумента", текДатаПодтверджающегоДокумента);
		СтрокаТаблицы1.Вставить("ДатаПодтверждающегоДокумента_Представление", Формат(СтрокаТаблицы1.ДатаПодтверждающегоДокумента, "ДФ=dd.MM.yyyy"));
		
		// вид документа
		СтрокаТаблицы1.Вставить("ВидДокумента", СтрокаТЧ.ВидДокумента.Код);
		
		// код валюты документа
		СтрокаТаблицы1.Вставить("ВалютаДокументаКод", СтрокаТЧ.ВалютаДокумента.Код);

		// сумма в валюте документа
		СтрокаТаблицы1.Вставить("СуммаВВалютеДокумента", ВыборкаИтоги.СуммаВВалютеДокумента);
		Если ВыборкаИтоги.СуммаАвансаВВалютеДокумента = 0 Или ВыборкаИтоги.СуммаВВалютеДокумента = ВыборкаИтоги.СуммаАвансаВВалютеДокумента Тогда
			СтрокаТаблицы1.Вставить("СуммаАвансаВВалютеДокумента", 0);
			СтрокаТаблицы1.Вставить("СуммаВВалютеДокумента_Представление", Формат(СтрокаТаблицы1.СуммаВВалютеДокумента, "ЧДЦ=2"));
		Иначе	
			СтрокаТаблицы1.Вставить("СуммаАвансаВВалютеДокумента", ВыборкаИтоги.СуммаАвансаВВалютеДокумента);
			СтрокаТаблицы1.Вставить("СуммаВВалютеДокумента_Представление", Формат(СтрокаТаблицы1.СуммаВВалютеДокумента, "ЧДЦ=2") + "/" + Формат(СтрокаТаблицы1.СуммаАвансаВВалютеДокумента, "ЧДЦ=2"));
		КонецЕсли;
		
		// код валюты контракта
		СтрокаТаблицы1.Вставить("ВалютаКонтрактаКод", СтрокаТЧ.ВалютаКонтракта.Код);

		// сумма в валюте контракта
		СтрокаТаблицы1.Вставить("СуммаВВалютеКонтракта", ВыборкаИтоги.СуммаВВалютеКонтракта);
		Если ВыборкаИтоги.СуммаАвансаВВалютеКонтракта = 0 Или ВыборкаИтоги.СуммаВВалютеКонтракта = ВыборкаИтоги.СуммаАвансаВВалютеКонтракта Тогда
			СтрокаТаблицы1.Вставить("СуммаАвансаВВалютеКонтракта", 0);
			СтрокаТаблицы1.Вставить("СуммаВВалютеКонтракта_Представление", Формат(СтрокаТаблицы1.СуммаВВалютеКонтракта, "ЧДЦ=2"));
		Иначе	
			СтрокаТаблицы1.Вставить("СуммаАвансаВВалютеКонтракта", ВыборкаИтоги.СуммаАвансаВВалютеКонтракта);
			СтрокаТаблицы1.Вставить("СуммаВВалютеКонтракта_Представление", Формат(СтрокаТаблицы1.СуммаВВалютеКонтракта, "ЧДЦ=2") + "/" + Формат(СтрокаТаблицы1.СуммаАвансаВВалютеКонтракта, "ЧДЦ=2"));
		КонецЕсли;
		
		// признак поставки
		СтрокаТаблицы1.Вставить("ПризнакПоставки", Сред(Строка(СтрокаТЧ.ПризнакПоставки), 1, 1));
		
		// ожидаемый срок
		СтрокаТаблицы1.Вставить("ОжидаемыйСрок", СтрокаТЧ.ОжидаемыйСрок);
		СтрокаТаблицы1.Вставить("ОжидаемыйСрок_Представление", Формат(СтрокаТаблицы1.ОжидаемыйСрок, "ДФ=dd.MM.yyyy"));
		
		// код страны грузоотправителя/грузополучателя
		СтрокаТаблицы1.Вставить("КодСтраныГрузоотправителя", СтрокаТЧ.СтранаГрузоотправителяГрузополучателя.Код);
		
		ДанныеДляПечати.Таблица1.Добавить(СтрокаТаблицы1);
		
		//Таблица 2
		ВыборкаСтроки.Сбросить();
		ТекстПримечания = "";
		Пока ВыборкаСтроки.Следующий() Цикл
			СтрокаТЧ_Примечание = ЭтотОбъект[ИмяТЧ][ВыборкаСтроки.НомерСтроки - 1];
			Если Не ПустаяСтрока(СтрокаТЧ_Примечание.Примечание) Тогда
				ТекстПримечания = ТекстПримечания + ?(ТекстПримечания = "", "", "; ") + СокрЛП(СтрокаТЧ_Примечание.Примечание);
			КонецЕсли;
		КонецЦикла;
		Если Не ПустаяСтрока(ТекстПримечания) Тогда
			СтрокаТаблицы2 = Новый Структура;
			СтрокаТаблицы2.Вставить("НомерСтроки", ВыборкаИтоги.НомерСтрокиДляПечати);
			СтрокаТаблицы2.Вставить("Содержание", ТекстПримечания);
			ДанныеДляПечати.Таблица2.Добавить(СтрокаТаблицы2);
		КонецЕсли;
	КонецЦикла; 
		
	Возврат ДанныеДляПечати;
КонецФункции

Функция ПечатьСПД_2015() Экспорт
	ДанныеДляПечати = ДанныеДляПечати_2015();
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СправкаОПодтверждающихДокументах2015";
	
	Макет = ПолучитьМакет("СправкаОПодтверждающихДокументах_2015");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заполнить(ДанныеДляПечати.Шапка);
	ТабДокумент.Вывести(Область);
	
	Если ДанныеДляПечати.Таблица1.Количество() = 0 Тогда
		Область = Макет.ПолучитьОбласть("Строка");
		ТабДокумент.Вывести(Область);
	Иначе
		Для Каждого СтрокаТЧ Из ДанныеДляПечати.Таблица1 Цикл
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(СтрокаТЧ);
			ТабДокумент.Вывести(Область);
		КонецЦикла; 
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("ШапкаПримечание");
	ТабДокумент.Вывести(Область);
	
	Для Каждого СтрокаТЧ Из ДанныеДляПечати.Таблица2 Цикл
		Область = Макет.ПолучитьОбласть("Примечание");
		Область.Параметры.Заполнить(СтрокаТЧ);
		ТабДокумент.Вывести(Область);
	КонецЦикла; 
	
	Область = Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.Заполнить(ДанныеДляПечати.Шапка);
	ТабДокумент.Вывести(Область);
	
	УстановитьСтатусЗадачРаспечатана(1);
	
	Возврат ТабДокумент;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ВспомогательныеПроцедуры

Процедура ПроведениеПоРегиструСправкиВалютногоКонтроля()
	ПодтверждающиеДокументыСвернуто = ПодтверждающиеДокументы.Выгрузить();
	Для Каждого СтрокаТЧ Из ПодтверждающиеДокументыСвернуто Цикл
		СтрокаТЧ.ДопСоглашение = ?(КонтрактВЭД.РамочныйКонтракт, СтрокаТЧ.ДопСоглашение, Неопределено);
	КонецЦикла;	
	ПодтверждающиеДокументыСвернуто.Свернуть("Документ, ДопСоглашение, ВалютаДокумента", "СуммаВВалютеДокумента, СуммаВВалютеКонтракта");
	Для Каждого СтрокаТЧ Из ПодтверждающиеДокументыСвернуто Цикл
		Запись = Движения.РЭЙ_СправкиВалютногоКонтроля.Добавить();
		Запись.Период = Дата;
		Запись.КонтрактВЭД = КонтрактВЭД;
		Запись.ПаспортСделки = КонтрактВЭД.ПаспортСделки;
		Запись.РасчетныйДокумент = СтрокаТЧ.Документ;
		Запись.ДопСоглашение = СтрокаТЧ.ДопСоглашение;
		Запись.Справка = Ссылка;
		Запись.ВалютаДокумента = СтрокаТЧ.ВалютаДокумента;
		Запись.СуммаВВалютеДокумента = СтрокаТЧ.СуммаВВалютеДокумента;
		Запись.СуммаВВалютеКонтракта = СтрокаТЧ.СуммаВВалютеКонтракта;

		Имя = СокрЛП(ВРег(Запись.РасчетныйДокумент.Метаданные().Имя));
		Запись.ЭтоДебет = Не (Имя = ВРег("ПоступлениеТоваровУслуг") 
		Или Имя = ВРег("ПриобретениеТоваровУслуг") 
		Или Имя = ВРег("ПриобретениеУслугПрочихАктивов") 
		Или Имя = ВРег("ПоступлениеДопРасходов") 
		Или Имя = ВРег("ОтчетКомиссионераОПродажах"));
	КонецЦикла;
	
	
	ПодтверждающиеДокументыСвернуто = ПодтверждающиеДокументыРучные.Выгрузить();
	Для Каждого СтрокаТЧ Из ПодтверждающиеДокументыСвернуто Цикл
		СтрокаТЧ.ДопСоглашение = ?(КонтрактВЭД.РамочныйКонтракт, СтрокаТЧ.ДопСоглашение, Неопределено);
	КонецЦикла;	
	ПодтверждающиеДокументыСвернуто.Свернуть("ДопСоглашение, ВалютаДокумента", "СуммаВВалютеДокумента, СуммаВВалютеКонтракта");
	Для Каждого СтрокаТЧ Из ПодтверждающиеДокументыСвернуто Цикл
		Запись = Движения.РЭЙ_СправкиВалютногоКонтроля.Добавить();
		Запись.Период = Дата;
		Запись.КонтрактВЭД = КонтрактВЭД;
		Запись.ПаспортСделки = КонтрактВЭД.ПаспортСделки;
		Запись.ИдентификаторРучнойОперации = Новый УникальныйИдентификатор;
		Запись.ДопСоглашение = СтрокаТЧ.ДопСоглашение;
		Запись.Справка = Ссылка;
		Запись.ВалютаДокумента = СтрокаТЧ.ВалютаДокумента;
		Запись.СуммаВВалютеДокумента = СтрокаТЧ.СуммаВВалютеДокумента;
		Запись.СуммаВВалютеКонтракта = СтрокаТЧ.СуммаВВалютеКонтракта;
		Если Истина Тогда
			Запись.ЭтоДебет = Ложь;
		Иначе
			Запись.ЭтоДебет = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СтатусЗадачаВЭДСоздана()
	ИзменилиСтатус = Ложь;
	Для Каждого СтрокаТаб Из ПодтверждающиеДокументы Цикл
		СтатусЗадачи =  РЭЙ_ЗадачиСервер.ПолучитьСтатусЗадачиЗадачи(СтрокаТаб.Документ);
		ТД = СтрокаТаб.Документ;
		Если СтатусЗадачи = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСозданию 
			ИЛИ СтатусЗадачи = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСдачеЗавтра
			ИЛИ СтатусЗадачи = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСдачеПослеЗавтра
			ИЛИ СтатусЗадачи = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПодлежитСдачеСегодня
			ИЛИ СтатусЗадачи = Перечисления.РЭЙ_СтатусыСправокВалютногоКонтроля.СправкаПросрочена
			Тогда
			
			РЭЙ_ЗадачиСервер.УстановитьСтатусЗадачиВЭД(ТД, "Создана");	
			ИзменилиСтатус = Истина;
			
		КонецЕсли;
	КонецЦикла; 
	
	Если ИзменилиСтатус Тогда
		#Если Клиент Тогда
		Оповестить("ИзмененСтатусЗадачиВЭД");
		#КонецЕсли
	КонецЕсли; 
	
КонецПроцедуры

Процедура УстановитьСтатусЗадачРаспечатана(текВидПредоставленияДокументовПоСделке) Экспорт
	Если Банк.РЭЙ_ВидПредоставленияДокументовПоСделке = текВидПредоставленияДокументовПоСделке Или ФТСПередалаГТДвЦБР Тогда
		Если Не РучноеЗаполнение Тогда
			ТаблицаДокументов = ПодтверждающиеДокументы.Выгрузить(, "Документ");
			ТаблицаДокументов.Свернуть("Документ", "");
			Для Каждого СтрокаТЧ Из ТаблицаДокументов Цикл
				Если ЗначениеЗаполнено(СтрокаТЧ.Документ) Тогда
					РЭЙ_ЗадачиСервер.УстановитьСтатусЗадачиВЭД(СтрокаТЧ.Документ, "Распечатана");
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
